{
  "backend/main.mo": "Implements a canister storing contact form submissions and project images with CRUD-style submission and query functions.",
  "feature_evidence.json": "Contains feature evidence entries describing updates to the solar calculator’s max bill value and input validation changes.",
  "frontend-file-summaries.txt": "Lists short descriptions of various frontend components, hooks, pages, and configurations.",
  "frontend/index.html": "Main HTML entry with SEO metadata, Open Graph tags, preload optimizations, and security headers.",
  "frontend/public/robots.txt": "Defines basic crawling rules allowing all agents with a crawl delay.",
  "frontend/public/site.webmanifest": "Web app manifest defining PWA metadata, icons, theme colors, and display settings.",
  "frontend/public/sitemap.xml": "XML sitemap listing main site sections with last modified dates and image metadata.",
  "frontend/public/sw.js": "Service worker implementing simple caching, fetch handling, and cache versioning.",
  "frontend/src/App.tsx": "Root React component composing all site sections and initializing performance, preload, and service worker logic.",
  "frontend/src/components/About.tsx": "Renders the About section with animated counters triggered by intersection observer and styled content.",
  "frontend/src/components/Contact.tsx": "Implements a contact form with validation, smooth reveal animation, and submission via a custom mutation hook. Builds a formatted message payload and resets the form on success.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with company info, social links, quick navigation, and scroll-to-section actions. Includes branded visuals and structured contact details.",
  "frontend/src/components/Gallery.tsx": "Displays a categorized project gallery with intersection-based reveal animations. Provides image tabs and dialog-based viewing for multiple residential and commercial projects.",
  "frontend/src/components/Header.tsx": "Creates a sticky header with scroll-based styling, navigation links, mobile menu handling, and quick contact info. Supports smooth scrolling to page sections.",
  "frontend/src/components/Hero.tsx": "Renders the hero section with a parallax background, animated visuals, and buttons that scroll to services or contact. Tracks scroll position for parallax effects.",
  "frontend/src/components/MotivationalQuotes.tsx": "Displays animated motivational quote cards with icons and images that appear when scrolled into view.",
  "frontend/src/components/Partners.tsx": "Renders a grid of partner logos with fade‑in animations and decorative backgrounds.",
  "frontend/src/components/PMSuryaGhar.tsx": "Shows details of the PM Surya Ghar Yojana, including subsidies, DBT, loan benefits, and animated section reveal.",
  "frontend/src/components/Services.tsx": "Presents key solar service offerings and benefits with animated cards and images.",
  "frontend/src/components/SolarCalculator.tsx": "Provides an interactive solar savings calculator using roof area, monthly bill, and city sun hours with animated section reveal.",
  "frontend/src/components/Testimonials.tsx": "A testimonial carousel with auto-rotation, intersection-based animations, and navigation controls displaying customer reviews.",
  "frontend/src/components/Vision.tsx": "A section component showing the company's vision with intersection-triggered animations and decorative visuals.",
  "frontend/src/components/WhatsAppChatButton.tsx": "A floating WhatsApp chat button linking to a preset number with hover tooltip and animated styling.",
  "frontend/src/components/WhyChooseUs.tsx": "A feature and strengths showcase section with animated reveal behavior and structured lists of selling points.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, storing identity state, and exposing login/logout utilities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend calls for contact form submissions and gallery queries, dependent on the actor instance.",
  "frontend/src/index.css": "Defines Tailwind base layers and extensive CSS variables for dark theme colors, layout, and animation performance settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, then renders the main App component.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading, persisting, and clearing URL parameters using both query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors based on CSS variables, extended themes, animations, and plugin integrations.",
  "project_state.json": "Stores project metadata, existing features, and pending requests related to increasing the electricity bill calculator limit."
}